1) Demonstrate how to import Pandas and check the version of the installation.

In [2]:
#pip install pandas 
import pandas as pd
import matplotlib as plt

2) Transform this list, numpy array, and dictionary into a series.

In [3]:
import numpy as np
mylist = list('abcedfghijklmnopqrstuvwxyz')
list_series = pd.Series(mylist)
#print(list_series)

myarr = np.arange(26)
array_series = pd.Series(myarr)
#print(array_series)

mydict = dict(zip(mylist, myarr))
dict_series = pd.Series(mydict)
print(dict_series)

a     0
b     1
c     2
e     3
d     4
f     5
g     6
h     7
i     8
j     9
k    10
l    11
m    12
n    13
o    14
p    15
q    16
r    17
s    18
t    19
u    20
v    21
w    22
x    23
y    24
z    25
dtype: int32

3) Convert the index of your previous series into a column of the dataframe.

In [4]:
df = list_series.to_frame().reset_index()
#rename column names
df.rename(columns= {"index": "newIndex"}, inplace= True)
print(df)

    newIndex  0
0          0  a
1          1  b
2          2  c
3          3  e
4          4  d
5          5  f
6          6  g
7          7  h
8          8  i
9          9  j
10        10  k
11        11  l
12        12  m
13        13  n
14        14  o
15        15  p
16        16  q
17        17  r
18        18  s
19        19  t
20        20  u
21        21  v
22        22  w
23        23  x
24        24  y
25        25  z

4) Combine the series below into one dataframe.

In [5]:
import numpy as np
ser1 = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))
ser2 = pd.Series(np.arange(26))

# print(ser1)
# print(ser2)
#df = pd.concat([ser1, ser2], axis= 1).reset_index()
#print(df)

df = pd.concat([list_series, array_series], axis= 1).reset_index()
print(df)

    index  0   1
0       0  a   0
1       1  b   1
2       2  c   2
3       3  e   3
4       4  d   4
5       5  f   5
6       6  g   6
7       7  h   7
8       8  i   8
9       9  j   9
10     10  k  10
11     11  l  11
12     12  m  12
13     13  n  13
14     14  o  14
15     15  p  15
16     16  q  16
17     17  r  17
18     18  s  18
19     19  t  19
20     20  u  20
21     21  v  21
22     22  w  22
23     23  x  23
24     24  y  24
25     25  z  25

5) Give the series below a name.

In [6]:
ser = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))

ser.rename("series_1")

0     a
1     b
2     c
3     e
4     d
5     f
6     g
7     h
8     i
9     j
10    k
11    l
12    m
13    n
14    o
15    p
16    q
17    r
18    s
19    t
20    u
21    v
22    w
23    x
24    y
25    z
Name: series_1, dtype: object

6) Find the elements in the first series (ser1) not in the second series (ser2).

In [7]:
ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])


print(set(ser1) - set(ser2)) # in ser1 but not in ser2
print(set(ser2) - set(ser1)) # in ser2 but not in ser1

{1, 2, 3}
{8, 6, 7}

7) Find the elements in both series that are not in common (remove them if they exist in both).

In [8]:
ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])

#uncommon 

union = pd.Series(np.union1d(ser1, ser2)) #union
intersect = pd.Series(np.intersect1d(ser1, ser2)) #intersect
uncommon = union[~union.isin(intersect)] # in union not in intersect

print(set(union) - set(intersect)) 
print(uncommon)

{1, 2, 3, 6, 7, 8}
0    1
1    2
2    3
5    6
6    7
7    8
dtype: int64

8) Find the minimum, max, 25th percentile, and 75th percentile in the series.

In [9]:
ser = pd.Series(np.random.normal(10, 5, 25))
print(ser.describe()) # stat of series
print(ser.min()) #min
print(ser.max()) #max
print(ser.quantile(.25)) #25 percentile
print(ser.quantile(.75)) #75 percentile

count    25.000000
mean      8.182738
std       4.063651
min      -1.503241
25%       5.988384
50%       8.499110
75%      10.715333
max      14.968459
dtype: float64
-1.503240747350496
14.968458621559424
5.988384459946702
10.715332795738666

9) Obtain the count of each unique item in the series.

In [10]:
ser = pd.Series(np.take(list('abcdefgh'), np.random.randint(8, size=30)))
print(ser.unique(), len(ser.unique())) # get unique item, and count using length of list
print(ser.nunique()) # count unique .nunique

['g' 'a' 'f' 'e' 'b' 'c' 'h' 'd'] 8
8

10) Keep the two most frequent items in the series and change all items that are not those two into "Other".

In [11]:
np.random.RandomState(100)
ser = pd.Series(np.random.randint(1, 5, [12]))
#ser.value_counts().index[:]
other = ser[~ser.isin(ser.value_counts().index[:2])] = "other"
print(ser)

0         3
1         3
2         4
3     other
4         4
5         4
6     other
7     other
8         3
9     other
10        4
11    other
dtype: object

11) Bin the series below into 10 equal deciles and replace the values with the bin name.

In [12]:
ser = pd.Series(np.random.random(20))
df = pd.DataFrame(ser, columns = ["random"])
#print(df)

df['rank'] = pd.qcut(df["random"], 10, labels = False)
print(df)

      random  rank
0   0.960270     9
1   0.405334     2
2   0.918844     8
3   0.088511     0
4   0.444967     3
5   0.972081     9
6   0.871840     7
7   0.420728     3
8   0.608332     6
9   0.818036     7
10  0.048394     0
11  0.312285     2
12  0.495988     4
13  0.709618     6
14  0.594145     5
15  0.283876     1
16  0.293197     1
17  0.924771     8
18  0.549379     5
19  0.505571     4

12) Reshape the series ser into a dataframe with 7 rows and 5 columns.

In [13]:
ser = pd.Series(np.random.randint(1, 10, 35))
#print(ser.values.reshape(7,5))
df = pd.DataFrame(ser.values.reshape(7,5))
print(df)

   0  1  2  3  4
0  8  7  1  8  2
1  9  3  5  5  7
2  5  4  2  7  7
3  1  6  2  5  4
4  1  1  8  8  8
5  9  4  9  2  9
6  7  8  6  1  6

13) Find the positions of numbers that are multiples of 3 from ser.

In [14]:
ser = pd.Series(np.random.randint(1, 10, 7))
multi = np.where(ser % 3 == 0 )
print(ser)
print(multi)

0    2
1    2
2    7
3    9
4    8
5    6
6    3
dtype: int32
(array([3, 5, 6], dtype=int64),)

14) From ser, extract the items at positions in list pos.

In [15]:
ser = pd.Series(list('abcdefghijklmnopqrstuvwxyz'))
arr =  pd.array(list('abcdefghijklmnopqrstuvwxyz'))
pos = [0, 4, 8, 14, 20]

result = arr.take(pos) # take an array, and list out positions based off list
print(result)

<StringArray>
['a', 'e', 'i', 'o', 'u']
Length: 5, dtype: string

15) Stack ser1 and ser2 vertically and horizontally (to form a dataframe).

In [16]:
ser1 = pd.Series(range(5))
ser2 = pd.Series(list('abcde'))

df = pd.concat([ser1, ser2], axis= 1) #stack horizontally
df

df2 =  pd.concat([ser1, ser2]) #stack vertically
df2

0    0
1    1
2    2
3    3
4    4
0    a
1    b
2    c
3    d
4    e
dtype: object

16) Get the positions of items of ser2 in ser1 as a list.

In [17]:
ser1 = pd.Series([10, 9, 6, 5, 3, 1, 12, 8, 13])
ser2 = pd.Series([1, 3, 10, 13])

result = [pd.Index(ser1).get_loc(i) for i in ser2]
result
# get loc get location
# get index? index = pd.Index(ser1)

[5, 4, 0, 8]

17) Compute the mean squared error of truth and pred series.

In [18]:
truth = pd.Series(range(10))
pred = pd.Series(range(10)) + np.random.random(10)

mse =np.square(np.subtract(truth,pred)).mean() 
mse

0.4542147071323758

18) Change the first character of each word to upper case in each word of ser.

In [19]:
ser = pd.Series(['how', 'to', 'kick', 'ass?'])
ser.str.capitalize()

0     How
1      To
2    Kick
3    Ass?
dtype: object

19) Caluculate the number of characters for each element in the series.

In [20]:
ser = pd.Series(['how', 'to', 'kick', 'ass?'])
ser.str.len() #count char in word

0    3
1    2
2    4
3    4
dtype: int64

20) Caluculate the difference of differences between the consequtive numbers of ser.

In [21]:
ser = pd.Series([1, 3, 6, 10, 15, 21, 27, 35])
ser.diff()

0    NaN
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
6    6.0
7    8.0
dtype: float64

21) Convert the date-strings to a timeseries.

In [22]:
ser = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])
ser = pd.to_datetime(ser)
ser

0   2010-01-01 00:00:00
1   2011-02-02 00:00:00
2   2012-03-03 00:00:00
3   2013-04-04 00:00:00
4   2014-05-05 00:00:00
5   2015-06-06 12:20:00
dtype: datetime64[ns]

22) Get the day of month, week number, day of year and day of week from ser.

In [23]:
ser = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])
ser = pd.to_datetime(ser) #convert to datetime
ser.dt.month # get month from datetime
ser.dt.weekday  # get weekday
ser.dt.year  # get year
ser.dt.day_of_week #day of the week

0    4
1    2
2    5
3    3
4    0
5    5
dtype: int64

23) Change ser to dates that start with 4th of the respective months.

In [24]:
ser = pd.Series(['Jan 2010', 'Feb 2011', 'Mar 2012'])
for month in ser:
    ser = ser.replace(month, month[:4] + '4' + month[3:])
ser

0    Jan 4 2010
1    Feb 4 2011
2    Mar 4 2012
dtype: object

24) From ser, extract words that contain at least 2 vowels.

In [25]:
ser = pd.Series(['Apple', 'Orange', 'Plan', 'Python', 'Money'])
result = ser[ser.str.count('(?i)[AEIOU]') >= 2] 
# (?i) means case insensitive
# can specificy word you want in series.str.count, it can taks in a regex pattern
result

0     Apple
1    Orange
4     Money
dtype: object

25) Extract the valid emails from the series emails. The regex pattern for valid emails is provided as reference.

In [26]:
emails = pd.Series(['buying books at amazom.com', 'rameses@egypt.com', 'matt@t.co', 'narendra@modi.com'])
pattern ='[A-Za-z0-9._%+-]+@[A-Za-z0-9.-]+\\.[A-Za-z]{2,4}'
result = emails[emails.str.count(pattern) >= 1]
result

1    rameses@egypt.com
2            matt@t.co
3    narendra@modi.com
dtype: object

26) Compute the mean of weights of each fruit.

In [27]:
fruit = pd.Series(np.random.choice(['apple', 'banana', 'carrot'], 10), name = "fruits")
weights = pd.Series(np.linspace(1, 10, 10), name = "weights")
# print(weights.tolist())
# print(fruit.tolist())
result = pd.concat([fruit, weights], axis= 1) # need to combine two series into one data frame, but also add their column names so i can specify my groupby columns
result.reset_index # reset the index
result.groupby(["fruits"]).mean() # group by the fruit and get the mean of each fruit

#examples
#> [1.0, 2.0, 3.0, 4.0, 5.0, 6.0, 7.0, 8.0, 9.0, 10.0]
#> ['banana', 'carrot', 'apple', 'carrot', 'carrot', 'apple', 'banana', 'carrot', 'apple', 'carrot']

        weights
fruits
apple      5.20
banana     8.00
carrot     5.25

27) Compute the euclidean distance between series (points) p and q, without using a packaged formula.

In [28]:
p = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])
q = pd.Series([10, 9, 8, 7, 6, 5, 4, 3, 2, 1])

summ = sum([(q[i] - p[i])**2 for i in range(len(p))])
distance = summ ** .5
distance

# dist = (np.linalg.norm(q-p))
# dist

18.16590212458495

28) Get the positions of peaks (values surrounded by smaller values on both sides) in ser.

In [29]:
ser = pd.Series([2, 10, 3, 4, 9, 10, 2, 7, 3])
positions = []
for i,v in enumerate(ser):
    try:
        if v > ser[i -1] and v > ser[i + 1]:
            positions.append(i)
    except:
        pass    

positions

[1, 5, 7]

29) Replace the spaces in my_str with the least frequent character.

In [30]:
my_str = 'dbc deb abed gade'

ser = pd.Series(list(my_str))
freq = ser.value_counts().dropna().index[-1] #get last position or the least occurence
my_str = my_str.replace(" ", freq)
my_str

'dbcgdebgabedggade'

30) Create a timeseries starting at ‘2000-01-01’ and 10 weekends (saturdays) after that having random numbers as values.

In [31]:
time = pd.date_range(start = '2000-01-01', periods= 10, freq= "W-SAT") # start,  appearnace, when 
time

DatetimeIndex(['2000-01-01', '2000-01-08', '2000-01-15', '2000-01-22',
               '2000-01-29', '2000-02-05', '2000-02-12', '2000-02-19',
               '2000-02-26', '2000-03-04'],
              dtype='datetime64[ns]', freq='W-SAT')

31) Series ser has missing dates and values. Make all missing dates appear and fill up with value from previous date.

skipped for now

In [32]:
ser = pd.Series([1,10,3,np.nan], index=pd.to_datetime(['2000-01-01', '2000-01-03', '2000-01-06', '2000-01-08']))
ser.resample("D").ffill()
#> 2000-01-01     1.0
#> 2000-01-03    10.0
#> 2000-01-06     3.0
#> 2000-01-08     NaN
#> dtype: float64

2000-01-01     1.0
2000-01-02     1.0
2000-01-03    10.0
2000-01-04    10.0
2000-01-05    10.0
2000-01-06     3.0
2000-01-07     3.0
2000-01-08     NaN
Freq: D, dtype: float64

32) Compute autocorrelations for the first 10 lags of ser. Find out which lag has the largest correlation.

In [33]:
ser = pd.Series(np.arange(20) + np.random.normal(1, 10, 20))

lag_ser = pd.Series(ser.autocorr(lag) for lag in range(1,11)) # convert to series 

lag_ser.sort_values(ascending= False).head(1) # sort values, and get first lag of the series

0    0.569851
dtype: float64

33) Import every 50th row of BostonHousing dataset as a dataframe.
    https://raw.githubusercontent.com/selva86/datasets/master/BostonHousing.csv

In [50]:
url = "https://raw.githubusercontent.com/selva86/datasets/master/BostonHousing.csv"
df = pd.read_csv(url, chunksize= 50)

df_result = pd.concat([chunk.iloc[0] for chunk in df], axis=1)
df_result.T

,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,b,lstat,medv
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
50,0.08873,21.0,5.64,0.0,0.439,5.963,45.7,6.8147,4.0,243.0,16.8,395.56,13.45,19.7
100,0.14866,0.0,8.56,0.0,0.520,6.727,79.9,2.7778,5.0,384.0,20.9,394.76,9.42,27.5
150,1.65660,0.0,19.58,0.0,0.871,6.122,97.3,1.6180,5.0,403.0,14.7,372.80,14.10,21.5
200,0.01778,95.0,1.47,0.0,0.403,7.135,13.9,7.6534,3.0,402.0,17.0,384.30,4.45,32.9
250,0.14030,22.0,5.86,0.0,0.431,6.487,13.0,7.3967,7.0,330.0,19.1,396.28,5.90,24.4
300,0.04417,70.0,2.24,0.0,0.400,6.871,47.4,7.8278,5.0,358.0,14.8,390.86,6.07,24.8
350,0.06211,40.0,1.25,0.0,0.429,6.490,44.4,8.7921,1.0,335.0,19.7,396.90,5.98,22.9
400,25.04610,0.0,18.10,0.0,0.693,5.987,100.0,1.5888,24.0,666.0,20.2,396.90,26.77,5.6
450,6.71772,0.0,18.10,0.0,0.713,6.749,92.6,2.3236,24.0,666.0,20.2,0.32,17.44,13.4
500,0.22438,0.0,9.69,0.0,0.585,6.027,79.7,2.4982,6.0,391.0,19.2,396.90,14.33,16.8

34) Import the boston housing dataset, but while importing change the 'medv' (median house value) column so that values < 25 becomes ‘Low’ and > 25 becomes ‘High’.

In [51]:
url = "https://raw.githubusercontent.com/selva86/datasets/master/BostonHousing.csv"
conv = {"medv": lambda x: "high" if float(x) > 25 else "low"  }

df = pd.read_csv(url, converters= conv)
df.head()

,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,b,lstat,medv
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296,15.3,396.90,4.98,low
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242,17.8,396.90,9.14,low
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242,17.8,392.83,4.03,high
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222,18.7,394.63,2.94,high
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222,18.7,396.90,5.33,high

35) Create a dataframe with rows as strides from the series "L".

In [ ]:
L = pd.Series(range(15))

36) Import ‘crim’ and ‘medv’ columns of the BostonHousing dataset as a dataframe.

In [54]:
url = "https://raw.githubusercontent.com/selva86/datasets/master/BostonHousing.csv"
col = ["crim", "medv"]
pd.read_csv(url, usecols= col).head()

      crim  medv
0  0.00632  24.0
1  0.02731  21.6
2  0.02729  34.7
3  0.03237  33.4
4  0.06905  36.2

37) Get the number of rows, columns, datatype and summary statistics of each column of the Cars93 dataset. Also get the numpy array and list equivalent of the dataframe.

https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv

In [76]:
url = "https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv"
df37 = pd.read_csv(url)
display(df37.describe, df37.shape, df37.dtypes)

array =df37.values
df_list = array.tolist()

<bound method NDFrame.describe of    Manufacturer    Model     Type  Min.Price  Price  Max.Price  MPG.city  \
0         Acura  Integra    Small       12.9   15.9       18.8      25.0
1           NaN   Legend  Midsize       29.2   33.9       38.7      18.0
2          Audi       90  Compact       25.9   29.1       32.3      20.0
3          Audi      100  Midsize        NaN   37.7       44.6      19.0
4           BMW     535i  Midsize        NaN   30.0        NaN      22.0
..          ...      ...      ...        ...    ...        ...       ...
88   Volkswagen  Eurovan      Van       16.6   19.7       22.7      17.0
89   Volkswagen   Passat  Compact       17.6   20.0       22.4      21.0
90   Volkswagen  Corrado   Sporty       22.9   23.3       23.7      18.0
91        Volvo      240  Compact       21.8   22.7       23.5      21.0
92          NaN      850  Midsize       24.8   26.7       28.5      20.0

    MPG.highway             AirBags DriveTrain  ... Passengers  Length  \
0          31.0                None      Front  ...        5.0   177.0
1          25.0  Driver & Passenger      Front  ...        5.0   195.0
2          26.0         Driver only      Front  ...        5.0   180.0
3          26.0  Driver & Passenger        NaN  ...        6.0   193.0
4          30.0                 NaN       Rear  ...        4.0   186.0
..          ...                 ...        ...  ...        ...     ...
88         21.0                None      Front  ...        7.0   187.0
89         30.0                None      Front  ...        5.0   180.0
90         25.0                None      Front  ...        4.0   159.0
91         28.0         Driver only       Rear  ...        5.0   190.0
92         28.0  Driver & Passenger      Front  ...        5.0   184.0

    Wheelbase  Width  Turn.circle Rear.seat.room  Luggage.room  Weight  \
0       102.0   68.0         37.0           26.5           NaN  2705.0
1       115.0   71.0         38.0           30.0          15.0  3560.0
2       102.0   67.0         37.0           28.0          14.0  3375.0
3       106.0    NaN         37.0           31.0          17.0  3405.0
4       109.0   69.0         39.0           27.0          13.0  3640.0
..        ...    ...          ...            ...           ...     ...
88      115.0   72.0         38.0           34.0           NaN  3960.0
89      103.0   67.0         35.0           31.5          14.0  2985.0
90       97.0   66.0         36.0           26.0          15.0  2810.0
91      104.0   67.0         37.0           29.5          14.0  2985.0
92      105.0   69.0         38.0           30.0          15.0  3245.0

     Origin                Make
0   non-USA       Acura Integra
1   non-USA        Acura Legend
2   non-USA             Audi 90
3   non-USA            Audi 100
4   non-USA            BMW 535i
..      ...                 ...
88      NaN  Volkswagen Eurovan
89  non-USA   Volkswagen Passat
90  non-USA  Volkswagen Corrado
91  non-USA           Volvo 240
92  non-USA           Volvo 850

[93 rows x 27 columns]>

(93, 27)

Manufacturer           object
Model                  object
Type                   object
Min.Price             float64
Price                 float64
Max.Price             float64
MPG.city              float64
MPG.highway           float64
AirBags                object
DriveTrain             object
Cylinders              object
EngineSize            float64
Horsepower            float64
RPM                   float64
Rev.per.mile          float64
Man.trans.avail        object
Fuel.tank.capacity    float64
Passengers            float64
Length                float64
Wheelbase             float64
Width                 float64
Turn.circle           float64
Rear.seat.room        float64
Luggage.room          float64
Weight                float64
Origin                 object
Make                   object
dtype: object

38) Which manufacturer, model and type has the highest Price? What is the row and column number of the cell with the highest Price value?

In [68]:
url = "https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv"
df = pd.read_csv(url)
high_price =  df["Price"].max() # get highest price
query = df.query(f"Price == {high_price}")
query[["Manufacturer", "Model", "Type"]]

     Manufacturer Model     Type
58  Mercedes-Benz  300E  Midsize

39) Rename the column "Type" as "CarType" in the previous data and replace the ‘.’ in column names with ‘_’.

In [72]:
url = "https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv"
df = pd.read_csv(url)

tmp = [col.replace('.', '_') for col in df.columns]
df.columns = tmp
df

,Manufacturer,Model,Type,Min_Price,Price,Max_Price,MPG_city,MPG_highway,AirBags,DriveTrain,...,Passengers,Length,Wheelbase,Width,Turn_circle,Rear_seat_room,Luggage_room,Weight,Origin,Make
0,Acura,Integra,Small,12.9,15.9,18.8,25.0,31.0,None,Front,...,5.0,177.0,102.0,68.0,37.0,26.5,NaN,2705.0,non-USA,Acura Integra
1,NaN,Legend,Midsize,29.2,33.9,38.7,18.0,25.0,Driver & Passenger,Front,...,5.0,195.0,115.0,71.0,38.0,30.0,15.0,3560.0,non-USA,Acura Legend
2,Audi,90,Compact,25.9,29.1,32.3,20.0,26.0,Driver only,Front,...,5.0,180.0,102.0,67.0,37.0,28.0,14.0,3375.0,non-USA,Audi 90
3,Audi,100,Midsize,NaN,37.7,44.6,19.0,26.0,Driver & Passenger,NaN,...,6.0,193.0,106.0,NaN,37.0,31.0,17.0,3405.0,non-USA,Audi 100
4,BMW,535i,Midsize,NaN,30.0,NaN,22.0,30.0,NaN,Rear,...,4.0,186.0,109.0,69.0,39.0,27.0,13.0,3640.0,non-USA,BMW 535i
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
88,Volkswagen,Eurovan,Van,16.6,19.7,22.7,17.0,21.0,None,Front,...,7.0,187.0,115.0,72.0,38.0,34.0,NaN,3960.0,NaN,Volkswagen Eurovan
89,Volkswagen,Passat,Compact,17.6,20.0,22.4,21.0,30.0,None,Front,...,5.0,180.0,103.0,67.0,35.0,31.5,14.0,2985.0,non-USA,Volkswagen Passat
90,Volkswagen,Corrado,Sporty,22.9,23.3,23.7,18.0,25.0,None,Front,...,4.0,159.0,97.0,66.0,36.0,26.0,15.0,2810.0,non-USA,Volkswagen Corrado
91,Volvo,240,Compact,21.8,22.7,23.5,21.0,28.0,Driver only,Rear,...,5.0,190.0,104.0,67.0,37.0,29.5,14.0,2985.0,non-USA,Volvo 240
92,NaN,850,Midsize,24.8,26.7,28.5,20.0,28.0,Driver & Passenger,Front,...,5.0,184.0,105.0,69.0,38.0,30.0,15.0,3245.0,non-USA,Volvo 850

40) Check if the data from #37 has any missing values.

In [83]:
df37.isnull().any().any()

True

41) Count the number of missing values in each column of the previous data. Which column has the maximum number of missing values?

In [93]:
df37.isnull().sum().sort_values(ascending= False).head(1)

Luggage.room    19
dtype: int64

42) Replace missing values in Min.Price and Max.Price columns with their respective mean.

In [97]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

for col in ["Min.Price", "Max.Price"]:
    mean = df[col].mean()
    df[col] = df[col].fillna(mean)

df[["Min.Price", "Max.Price"]].isnull().any() # find if any of the columns have a null and use any to check

Min.Price    False
Max.Price    False
dtype: bool

43) In the previous data, use apply method to replace the missing values in Min.Price with the column’s mean and those in Max.Price with the column’s median.

In [103]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')
d = {"Min.Price" : np.nanmean, "Max.Price": np.nanmean}
df[['Min.Price', 'Max.Price']] = df[['Min.Price', 'Max.Price']].apply(lambda x, d: x.fillna(d[x.name](x)), args=(d, ))
df

,Manufacturer,Model,Type,Min.Price,Price,Max.Price,MPG.city,MPG.highway,AirBags,DriveTrain,...,Passengers,Length,Wheelbase,Width,Turn.circle,Rear.seat.room,Luggage.room,Weight,Origin,Make
0,Acura,Integra,Small,12.900000,15.9,18.800000,25.0,31.0,None,Front,...,5.0,177.0,102.0,68.0,37.0,26.5,NaN,2705.0,non-USA,Acura Integra
1,NaN,Legend,Midsize,29.200000,33.9,38.700000,18.0,25.0,Driver & Passenger,Front,...,5.0,195.0,115.0,71.0,38.0,30.0,15.0,3560.0,non-USA,Acura Legend
2,Audi,90,Compact,25.900000,29.1,32.300000,20.0,26.0,Driver only,Front,...,5.0,180.0,102.0,67.0,37.0,28.0,14.0,3375.0,non-USA,Audi 90
3,Audi,100,Midsize,17.118605,37.7,44.600000,19.0,26.0,Driver & Passenger,NaN,...,6.0,193.0,106.0,NaN,37.0,31.0,17.0,3405.0,non-USA,Audi 100
4,BMW,535i,Midsize,17.118605,30.0,21.459091,22.0,30.0,NaN,Rear,...,4.0,186.0,109.0,69.0,39.0,27.0,13.0,3640.0,non-USA,BMW 535i
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
88,Volkswagen,Eurovan,Van,16.600000,19.7,22.700000,17.0,21.0,None,Front,...,7.0,187.0,115.0,72.0,38.0,34.0,NaN,3960.0,NaN,Volkswagen Eurovan
89,Volkswagen,Passat,Compact,17.600000,20.0,22.400000,21.0,30.0,None,Front,...,5.0,180.0,103.0,67.0,35.0,31.5,14.0,2985.0,non-USA,Volkswagen Passat
90,Volkswagen,Corrado,Sporty,22.900000,23.3,23.700000,18.0,25.0,None,Front,...,4.0,159.0,97.0,66.0,36.0,26.0,15.0,2810.0,non-USA,Volkswagen Corrado
91,Volvo,240,Compact,21.800000,22.7,23.500000,21.0,28.0,Driver only,Rear,...,5.0,190.0,104.0,67.0,37.0,29.5,14.0,2985.0,non-USA,Volvo 240
92,NaN,850,Midsize,24.800000,26.7,28.500000,20.0,28.0,Driver & Passenger,Front,...,5.0,184.0,105.0,69.0,38.0,30.0,15.0,3245.0,non-USA,Volvo 850

44) Get the first column (a) in the data as a dataframe (rather than as a Series).

In [107]:
df = pd.DataFrame(np.arange(20).reshape(-1,5), columns = list("abcde"))
df[["a"]]

    a
0   0
1   5
2  10
3  15

45) Actually 3 questions.

In the data, interchange columns 'a' and 'c'.

Create a generic function to interchange two columns, without hardcoding column names.

Sort the columns in reverse alphabetical order, that is colume 'e' first through column 'a' last.

In [116]:
def swap_columns(df, col1, col2):
    df_swap = df.copy()
    col_list = list(df_swap.columns)
    col1_idx = col_list.index(col1)
    col2_idx = col_list.index(col2)
    col_list[col1_idx] = col2
    col_list[col2_idx] = col1
    return df_swap[col_list]

swap_columns(df, 'a', 'c')

# rev = sorted(list(df.columns), reverse= True)
# df[rev]

    c   b   a   d   e
0   2   1   0   3   4
1   7   6   5   8   9
2  12  11  10  13  14
3  17  16  15  18  19

46) Change the pandas display settings on printing the dataframe so it shows a maximum of 10 rows and 10 columns.

In [119]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')
pd.set_option('display.max_columns', 10)
pd.set_option('display.max_rows', 10)
pd.describe_option()

compute.use_bottleneck : bool
    Use the bottleneck library to accelerate if it is installed,
    the default is True
    Valid values: False,True
    [default: True] [currently: True]
compute.use_numba : bool
    Use the numba engine option for select operations if it is installed,
    the default is False
    Valid values: False,True
    [default: False] [currently: False]
compute.use_numexpr : bool
    Use the numexpr library to accelerate computation if it is installed,
    the default is True
    Valid values: False,True
    [default: True] [currently: True]
display.chop_threshold : float or None
    if set to a float value, all float values smaller than the given threshold
    will be displayed as exactly 0 by repr and friends.
    [default: None] [currently: None]
display.colheader_justify : 'left'/'right'
    Controls the justification of column headers. used by DataFrameFormatter.
    [default: right] [currently: right]
display.column_space No description available.
    [default: 12] [currently: 12]
display.date_dayfirst : boolean
    When True, prints and parses dates with the day first, eg 20/01/2005
    [default: False] [currently: False]
display.date_yearfirst : boolean
    When True, prints and parses dates with the year first, eg 2005/01/20
    [default: False] [currently: False]
display.encoding : str/unicode
    Defaults to the detected encoding of the console.
    Specifies the encoding to be used for strings returned by to_string,
    these are generally strings meant to be displayed on the console.
    [default: UTF-8] [currently: UTF-8]
display.expand_frame_repr : boolean
    Whether to print out the full DataFrame repr for wide DataFrames across
    multiple lines, `max_columns` is still respected, but the output will
    wrap-around across multiple "pages" if its width exceeds `display.width`.
    [default: True] [currently: True]
display.float_format : callable
    The callable should accept a floating point number and return
    a string with the desired format of the number. This is used
    in some places like SeriesFormatter.
    See formats.format.EngFormatter for an example.
    [default: None] [currently: None]
display.html.border : int
    A ``border=value`` attribute is inserted in the ``<table>`` tag
    for the DataFrame HTML repr.
    [default: 1] [currently: 1]
display.html.table_schema : boolean
    Whether to publish a Table Schema representation for frontends
    that support it.
    (default: False)
    [default: False] [currently: False]
display.html.use_mathjax : boolean
    When True, Jupyter notebook will process table contents using MathJax,
    rendering mathematical expressions enclosed by the dollar symbol.
    (default: True)
    [default: True] [currently: True]
display.large_repr : 'truncate'/'info'
    For DataFrames exceeding max_rows/max_cols, the repr (and HTML repr) can
    show a truncated table (the default from 0.13), or switch to the view from
    df.info() (the behaviour in earlier versions of pandas).
    [default: truncate] [currently: truncate]
display.latex.escape : bool
    This specifies if the to_latex method of a Dataframe uses escapes special
    characters.
    Valid values: False,True
    [default: True] [currently: True]
display.latex.longtable :bool
    This specifies if the to_latex method of a Dataframe uses the longtable
    format.
    Valid values: False,True
    [default: False] [currently: False]
display.latex.multicolumn : bool
    This specifies if the to_latex method of a Dataframe uses multicolumns
    to pretty-print MultiIndex columns.
    Valid values: False,True
    [default: True] [currently: True]
display.latex.multicolumn_format : bool
    This specifies if the to_latex method of a Dataframe uses multicolumns
    to pretty-print MultiIndex columns.
    Valid values: False,True
    [default: l] [currently: l]
display.latex.multirow : bool
    This specifies if the to_latex method of a Dataframe uses multirows
    to pretty-print MultiIndex rows.
    Valid values: False,True
    [default: False] [currently: False]
display.latex.repr : boolean
    Whether to produce a latex DataFrame representation for jupyter
    environments that support it.
    (default: False)
    [default: False] [currently: False]
display.max_categories : int
    This sets the maximum number of categories pandas should output when
    printing out a `Categorical` or a Series of dtype "category".
    [default: 8] [currently: 8]
display.max_columns : int
    If max_cols is exceeded, switch to truncate view. Depending on
    `large_repr`, objects are either centrally truncated or printed as
    a summary view. 'None' value means unlimited.

    In case python/IPython is running in a terminal and `large_repr`
    equals 'truncate' this can be set to 0 and pandas will auto-detect
    the width of the terminal and print a truncated object which fits
    the screen width. The IPython notebook, IPython qtconsole, or IDLE
    do not run in a terminal and hence it is not possible to do
    correct auto-detection.
    [default: 20] [currently: 10]
display.max_colwidth : int or None
    The maximum width in characters of a column in the repr of
    a pandas data structure. When the column overflows, a "..."
    placeholder is embedded in the output. A 'None' value means unlimited.
    [default: 50] [currently: 50]
display.max_dir_items : int
    The number of items that will be added to `dir(...)`. 'None' value means
    unlimited. Because dir is cached, changing this option will not immediately
    affect already existing dataframes until a column is deleted or added.

    This is for instance used to suggest columns from a dataframe to tab
    completion.
    [default: 100] [currently: 100]
display.max_info_columns : int
    max_info_columns is used in DataFrame.info method to decide if
    per column information will be printed.
    [default: 100] [currently: 100]
display.max_info_rows : int or None
    df.info() will usually show null-counts for each column.
    For large frames this can be quite slow. max_info_rows and max_info_cols
    limit this null check only to frames with smaller dimensions than
    specified.
    [default: 1690785] [currently: 1690785]
display.max_rows : int
    If max_rows is exceeded, switch to truncate view. Depending on
    `large_repr`, objects are either centrally truncated or printed as
    a summary view. 'None' value means unlimited.

    In case python/IPython is running in a terminal and `large_repr`
    equals 'truncate' this can be set to 0 and pandas will auto-detect
    the height of the terminal and print a truncated object which fits
    the screen height. The IPython notebook, IPython qtconsole, or
    IDLE do not run in a terminal and hence it is not possible to do
    correct auto-detection.
    [default: 60] [currently: 10]
display.max_seq_items : int or None
    When pretty-printing a long sequence, no more then `max_seq_items`
    will be printed. If items are omitted, they will be denoted by the
    addition of "..." to the resulting string.

    If set to None, the number of items to be printed is unlimited.
    [default: 100] [currently: 100]
display.memory_usage : bool, string or None
    This specifies if the memory usage of a DataFrame should be displayed when
    df.info() is called. Valid values True,False,'deep'
    [default: True] [currently: True]
display.min_rows : int
    The numbers of rows to show in a truncated view (when `max_rows` is
    exceeded). Ignored when `max_rows` is set to None or 0. When set to
    None, follows the value of `max_rows`.
    [default: 10] [currently: 10]
display.multi_sparse : boolean
    "sparsify" MultiIndex display (don't display repeated
    elements in outer levels within groups)
    [default: True] [currently: True]
display.notebook_repr_html : boolean
    When True, IPython notebook will use html representation for
    pandas objects (if it is available).
    [default: True] [currently: True]
display.pprint_nest_depth : int
    Controls the number of nested levels to process when pretty-printing
    [default: 3] [currently: 3]
display.precision : int
    Floating point output precision in terms of number of places after the
    decimal, for regular formatting as well as scientific notation. Similar
    to ``precision`` in :meth:`numpy.set_printoptions`.
    [default: 6] [currently: 6]
display.show_dimensions : boolean or 'truncate'
    Whether to print out dimensions at the end of DataFrame repr.
    If 'truncate' is specified, only print out the dimensions if the
    frame is truncated (e.g. not display all rows and/or columns)
    [default: truncate] [currently: truncate]
display.unicode.ambiguous_as_wide : boolean
    Whether to use the Unicode East Asian Width to calculate the display text
    width.
    Enabling this may affect to the performance (default: False)
    [default: False] [currently: False]
display.unicode.east_asian_width : boolean
    Whether to use the Unicode East Asian Width to calculate the display text
    width.
    Enabling this may affect to the performance (default: False)
    [default: False] [currently: False]
display.width : int
    Width of the display in characters. In case python/IPython is running in
    a terminal this can be set to None and pandas will correctly auto-detect
    the width.
    Note that the IPython notebook, IPython qtconsole, or IDLE do not run in a
    terminal and hence it is not possible to correctly detect the width.
    [default: 80] [currently: 80]
io.excel.ods.reader : string
    The default Excel reader engine for 'ods' files. Available options:
    auto, odf.
    [default: auto] [currently: auto]
io.excel.ods.writer : string
    The default Excel writer engine for 'ods' files. Available options:
    auto, odf.
    [default: auto] [currently: auto]
io.excel.xls.reader : string
    The default Excel reader engine for 'xls' files. Available options:
    auto, xlrd.
    [default: auto] [currently: auto]
io.excel.xls.writer : string
    The default Excel writer engine for 'xls' files. Available options:
    auto, xlwt.
    [default: auto] [currently: auto]
    (Deprecated, use `` instead.)
io.excel.xlsb.reader : string
    The default Excel reader engine for 'xlsb' files. Available options:
    auto, pyxlsb.
    [default: auto] [currently: auto]
io.excel.xlsm.reader : string
    The default Excel reader engine for 'xlsm' files. Available options:
    auto, xlrd, openpyxl.
    [default: auto] [currently: auto]
io.excel.xlsm.writer : string
    The default Excel writer engine for 'xlsm' files. Available options:
    auto, openpyxl.
    [default: auto] [currently: auto]
io.excel.xlsx.reader : string
    The default Excel reader engine for 'xlsx' files. Available options:
    auto, xlrd, openpyxl.
    [default: auto] [currently: auto]
io.excel.xlsx.writer : string
    The default Excel writer engine for 'xlsx' files. Available options:
    auto, openpyxl, xlsxwriter.
    [default: auto] [currently: auto]
io.hdf.default_format : format
    default format writing format, if None, then
    put will default to 'fixed' and append will default to 'table'
    [default: None] [currently: None]
io.hdf.dropna_table : boolean
    drop ALL nan rows when appending to a table
    [default: False] [currently: False]
io.parquet.engine : string
    The default parquet reader/writer engine. Available options:
    'auto', 'pyarrow', 'fastparquet', the default is 'auto'
    [default: auto] [currently: auto]
io.sql.engine : string
    The default sql reader/writer engine. Available options:
    'auto', 'sqlalchemy', the default is 'auto'
    [default: auto] [currently: auto]
mode.chained_assignment : string
    Raise an exception, warn, or no action if trying to use chained assignment,
    The default is warn
    [default: warn] [currently: warn]
mode.copy_on_write : bool
    Use new copy-view behaviour using Copy-on-Write. Defaults to False,
    unless overridden by the 'PANDAS_COPY_ON_WRITE' environment variable
    (if set to "1" for True, needs to be set before pandas is imported).
    [default: False] [currently: False]
mode.data_manager : string
    Internal data manager type; can be "block" or "array". Defaults to "block",
    unless overridden by the 'PANDAS_DATA_MANAGER' environment variable (needs
    to be set before pandas is imported).
    [default: block] [currently: block]
mode.sim_interactive : boolean
    Whether to simulate interactive mode for purposes of testing
    [default: False] [currently: False]
mode.string_storage : string
    The default storage for StringDtype.
    [default: python] [currently: python]
mode.use_inf_as_na : boolean
    True means treat None, NaN, INF, -INF as NA (old way),
    False means None and NaN are null, but INF, -INF are not NA
    (new way).
    [default: False] [currently: False]
mode.use_inf_as_null : boolean
    use_inf_as_null had been deprecated and will be removed in a future
    version. Use `use_inf_as_na` instead.
    [default: False] [currently: False]
    (Deprecated, use `mode.use_inf_as_na` instead.)
plotting.backend : str
    The plotting backend to use. The default value is "matplotlib", the
    backend provided with pandas. Other backends can be specified by
    providing the name of the module that implements the backend.
    [default: matplotlib] [currently: matplotlib]
plotting.matplotlib.register_converters : bool or 'auto'.
    Whether to register converters with matplotlib's units registry for
    dates, times, datetimes, and Periods. Toggling to False will remove
    the converters, restoring any converters that pandas overwrote.
    [default: auto] [currently: auto]
styler.format.decimal : str
    The character representation for the decimal separator for floats and complex.
    [default: .] [currently: .]
styler.format.escape : str, optional
    Whether to escape certain characters according to the given context; html or latex.
    [default: None] [currently: None]
styler.format.formatter : str, callable, dict, optional
    A formatter object to be used as default within ``Styler.format``.
    [default: None] [currently: None]
styler.format.na_rep : str, optional
    The string representation for values identified as missing.
    [default: None] [currently: None]
styler.format.precision : int
    The precision for floats and complex numbers.
    [default: 6] [currently: 6]
styler.format.thousands : str, optional
    The character representation for thousands separator for floats, int and complex.
    [default: None] [currently: None]
styler.html.mathjax : bool
    If False will render special CSS classes to table attributes that indicate Mathjax
    will not be used in Jupyter Notebook.
    [default: True] [currently: True]
styler.latex.environment : str
    The environment to replace ``\begin{table}``. If "longtable" is used results
    in a specific longtable environment format.
    [default: None] [currently: None]
styler.latex.hrules : bool
    Whether to add horizontal rules on top and bottom and below the headers.
    [default: False] [currently: False]
styler.latex.multicol_align : {"r", "c", "l", "naive-l", "naive-r"}
    The specifier for horizontal alignment of sparsified LaTeX multicolumns. Pipe
    decorators can also be added to non-naive values to draw vertical
    rules, e.g. "\|r" will draw a rule on the left side of right aligned merged cells.
    [default: r] [currently: r]
styler.latex.multirow_align : {"c", "t", "b"}
    The specifier for vertical alignment of sparsified LaTeX multirows.
    [default: c] [currently: c]
styler.render.encoding : str
    The encoding used for output HTML and LaTeX files.
    [default: utf-8] [currently: utf-8]
styler.render.max_columns : int, optional
    The maximum number of columns that will be rendered. May still be reduced to
    satsify ``max_elements``, which takes precedence.
    [default: None] [currently: None]
styler.render.max_elements : int
    The maximum number of data-cell (<td>) elements that will be rendered before
    trimming will occur over columns, rows or both if needed.
    [default: 262144] [currently: 262144]
styler.render.max_rows : int, optional
    The maximum number of rows that will be rendered. May still be reduced to
    satsify ``max_elements``, which takes precedence.
    [default: None] [currently: None]
styler.render.repr : str
    Determine which output to use in Jupyter Notebook in {"html", "latex"}.
    [default: html] [currently: html]
styler.sparse.columns : bool
    Whether to sparsify the display of hierarchical columns. Setting to False will
    display each explicit level element in a hierarchical key for each column.
    [default: True] [currently: True]
styler.sparse.index : bool
    Whether to sparsify the display of a hierarchical index. Setting to False will
    display each explicit level element in a hierarchical key for each row.
    [default: True] [currently: True]

47) Suppress scientific notations like ‘e-03’ in df and print upto 4 numbers after decimal.

In [125]:
df = pd.DataFrame(np.random.random(4), columns= ["random"])
df.style.format({'random':'{0:.2%}'.format,})

48) Format the values in column 'random' of df as percentages.

In [140]:
df = pd.DataFrame(np.random.random(4), columns=['random'])
df = df.style.format({'random':'{0: .2%}'.format,})
df


#>      random
#> 0    .689723
#> 1    .957224
#> 2    .159157
#> 3    .21082

49) From the cars data, filter the 'Manufacturer', 'Model' and 'Type' for every 20th row starting from 1st (row 0).

In [146]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')
print(df.iloc[::20, :][['Manufacturer', 'Model', 'Type']])

   Manufacturer    Model     Type
0         Acura  Integra    Small
20     Chrysler  LeBaron  Compact
40        Honda  Prelude   Sporty
60      Mercury   Cougar  Midsize
80       Subaru   Loyale    Small

50) In the cars data, Replace NaNs with ‘missing’ in columns 'Manufacturer', 'Model' and 'Type' and create a index as a combination of these three columns and check if the index is a primary key.

In [151]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')
df[['Manufacturer', 'Model', 'Type']] = df[['Manufacturer', 'Model', 'Type']].fillna('missing')
df.index = df.Manufacturer + '_' + df.Model + '_' + df.Type
print(df.index.is_unique)

True

51) Find the row position of the 5th largest value of column 'a' in df.

In [163]:
df = pd.DataFrame(np.random.randint(1, 30, 30).reshape(10,-1), columns=list('abc'))


df["a"].nlargest().index[-1]

8

52) In ser, find the position of the 2nd largest value greater than the mean.

In [158]:
ser = pd.Series(np.random.randint(1, 100, 15))
tmp = ser - ser.mean()
tmp.nlargest(2).index

Int64Index([14, 5], dtype='int64')

53) Get the last two rows of df whose row sum is greater than 100.

In [170]:
df = pd.DataFrame(np.random.randint(10, 40, 60).reshape(-1, 4))
df["RowSum"] = df.sum(axis=1)
df.query("RowSum > 100").tail(2)

    0   1   2   3  RowSum
8  17  32  37  20     106
9  27  25  23  29     104

54) Replace all values of ser in the lower 5%ile and greater than 95%ile with respective 5th and 95th %ile value.

In [173]:
ser = pd.Series(np.logspace(-2, 2, 30))
low = np.quantile(ser, q = .05)
high = np.quantile(ser, q = .95)
ser.clip(low, high)

0      0.016049
1      0.016049
2      0.018874
3      0.025929
4      0.035622
        ...
25    28.072162
26    38.566204
27    52.983169
28    63.876672
29    63.876672
Length: 30, dtype: float64

55) Reshape df to the largest possible square with negative values removed. Drop the smallest values if need be. The order of the positive numbers in the result should remain the same as the original.

In [174]:
df = pd.DataFrame(np.random.randint(-20, 50, 100).reshape(10,-1))

arr = df[df > 0].values.flatten()
arr_qualified = arr[~np.isnan(arr)]
n = int(np.floor(arr_qualified.shape[0]**.5))

top_indexes = np.argsort(arr_qualified)[::-1]
output = np.take(arr_qualified, sorted(top_indexes[:n**2])).reshape(n, -1)
print(output)

[[42. 19. 12. 35. 13. 31.  9. 22.]
 [31. 26. 19. 26. 28. 39. 18. 49.]
 [21. 37. 27. 19. 12. 29. 21. 40.]
 [47. 33. 31. 18. 48. 35. 15.  8.]
 [34. 40. 14. 41. 26. 35. 21. 39.]
 [36. 15. 37. 40.  9. 32. 29. 21.]
 [46. 22. 11. 15. 13. 15. 11. 47.]
 [15. 37. 34. 44. 22. 49. 28. 40.]]

56) Swap rows 1 and 2 in df.

In [175]:
df = pd.DataFrame(np.arange(25).reshape(5, -1))

display(df.head(2))
row1, row2 = df.iloc[0].copy(), df.iloc[1].copy()
df.iloc[0], df.iloc[1] = row2, row1
display(df.head(2))

   0  1  2  3  4
0  0  1  2  3  4
1  5  6  7  8  9

   0  1  2  3  4
0  5  6  7  8  9
1  0  1  2  3  4

57) Reverse all the rows of dataframe df.

In [176]:
df = pd.DataFrame(np.arange(25).reshape(5, -1))

df.iloc[::-1]

    0   1   2   3   4
4  20  21  22  23  24
3  15  16  17  18  19
2  10  11  12  13  14
1   5   6   7   8   9
0   0   1   2   3   4

58) Get one-hot encodings for column 'a' in the dataframe df and append it as columns.

In [178]:
df = pd.DataFrame(np.arange(25).reshape(5,-1), columns=list('abcde'))
'''    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24'''

df_onehot = pd.concat([pd.get_dummies(df['a']), df[list('bcde')]], axis=1)
df_onehot

   0  5  10  15  20   b   c   d   e
0  1  0   0   0   0   1   2   3   4
1  0  1   0   0   0   6   7   8   9
2  0  0   1   0   0  11  12  13  14
3  0  0   0   1   0  16  17  18  19
4  0  0   0   0   1  21  22  23  24

59) Obtain the column name with the highest number of row-wise maximum’s in df.

In [181]:
df = pd.DataFrame(np.random.randint(1,100, 40).reshape(10, -1))



df.apply(np.argmax, axis=1).value_counts().index[0]

0

60) Create a new column such that, each row contains the row number of nearest row-record by euclidean distance.

In [182]:
df = pd.DataFrame(np.random.randint(1,100, 40).reshape(10, -1), columns=list('pqrs'), index=list('abcdefghij'))
df
#     p   q   r   s
# a  57  77  13  62
# b  68   5  92  24
# c  74  40  18  37
# d  80  17  39  60
# e  93  48  85  33
# f  69  55   8  11
# g  39  23  88  53
# h  63  28  25  61
# i  18   4  73   7
# j  79  12  45  34

def get_neast_and_euclidean_dist(df):
    from scipy.spatial.distance import pdist, squareform
    row_name = df.index.tolist()
    dist = pdist(df, 'euclidean')
    df_dist = pd.DataFrame(squareform(dist), columns=row_name, index=row_name)
    
    nearest_list = []
    nearest_dist_list = []
    # instead of list comprehension
    # for loop is more readable for complex operation
    for row in df_dist.index:
        nearest_info = df_dist.loc[row, :].sort_values()
        nearest_idx, nearest_dist = nearest_info.index[1], nearest_info.values[1]
        nearest_list.append(nearest_idx)
        nearest_dist_list.append(nearest_dist)
    df_dist['nearset'] = nearest_list
    df_dist['dist'] = nearest_dist_list
    
    return df_dist
get_neast_and_euclidean_dist(df)

,a,b,c,d,e,...,h,i,j,nearset,dist
a,0.000000,66.798204,90.354856,86.804378,29.274562,...,44.215382,71.456280,91.706052,f,23.853721
b,66.798204,0.000000,85.451741,43.623388,61.326992,...,41.097445,112.116011,58.991525,h,41.097445
c,90.354856,85.451741,0.000000,60.934391,92.341757,...,100.184829,75.960516,56.373753,j,56.373753
d,86.804378,43.623388,60.934391,0.000000,78.000000,...,71.344236,106.418983,53.768020,b,43.623388
e,29.274562,61.326992,92.341757,78.000000,0.000000,...,49.578221,70.618694,98.412398,a,29.274562
f,23.853721,81.037029,83.636117,94.435163,49.658836,...,59.514704,64.876806,90.459936,a,23.853721
g,51.701064,80.293213,112.672091,92.249661,51.749396,...,48.682646,100.244701,114.048235,h,48.682646
h,44.215382,41.097445,100.184829,71.344236,49.578221,...,0.000000,108.448144,80.479811,b,41.097445
i,71.456280,112.116011,75.960516,106.418983,70.618694,...,108.448144,0.000000,115.403639,f,64.876806
j,91.706052,58.991525,56.373753,53.768020,98.412398,...,80.479811,115.403639,0.000000,d,53.768020

61) Compute maximum possible absolute correlation value of each column against other columns in df.

In [183]:
df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1), columns=list('pqrstuvwxy'), index=list('abcdefgh'))


corr_df = abs(df.corr())

max_corr_list = [(feature, 
                  (corr_df[feature].sort_values(ascending=False).index[1],
                   corr_df[feature].sort_values(ascending=False)[1]))
                 for feature in corr_df.columns]
max_corr_list

[('p', ('v', 0.45487252054157373)),
 ('q', ('r', 0.5259952762711403)),
 ('r', ('w', 0.5769091234556243)),
 ('s', ('y', 0.6290988603409129)),
 ('t', ('y', 0.7832728356515417)),
 ('u', ('q', 0.4456329444528712)),
 ('v', ('y', 0.8978399857706134)),
 ('w', ('y', 0.8492471697236579)),
 ('x', ('p', 0.34179309310241207)),
 ('y', ('v', 0.8978399857706134))]

62) Compute the minimum-by-maximum for every row of df.

In [184]:
df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1))

df['RowMinByMax'] = df.min(axis=0) / df.max(axis=0)
df.head()

    0   1   2   3   4  ...   6   7   8   9  RowMinByMax
0  55  25  72  44  13  ...  78  99  17  88     0.040404
1   4  18  37  47  59  ...  55  75   1  19     0.132653
2  35  98  31  99  78  ...  71  47  25  99     0.326316
3  71  13  95  61  84  ...  96  46  63  46     0.343434
4  26  77  78  94  33  ...  45  44  10  18     0.044444

[5 rows x 11 columns]

63) Create a new column 'penultimate' which has the second largest value of each row of df.

In [185]:
df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1))

row_penultimate_collection = []
for row in df.index:
    row_penultimate = df.loc[row,:].sort_values().iloc[1]
    row_penultimate_collection.append(row_penultimate)
df['Row_Penultimate'] = row_penultimate_collection
df.head()

    0   1   2   3   4  ...   6   7   8   9  Row_Penultimate
0   7  97  79  84  65  ...  60  17  55  38               17
1  68  47  26  99   9  ...  70  83  75  36               26
2  22   4  34  96  39  ...   8  56   4  26                4
3  20  71  97  98  89  ...  58   4  53  66               20
4  24  17  61   5  14  ...  98   9  50  85                9

[5 rows x 11 columns]

64) Normalize all columns of df by subtracting the column mean and divide by standard deviation.
Range all columns of df such that the minimum value in each column is 0 and max is 1.

In [186]:
df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1))

df.apply(lambda x: ((x - x.mean())/x.std()).round(2))

      0     1     2     3     4     5     6     7     8     9
0  1.19 -0.50  0.52  1.05 -0.89  0.85 -1.53  0.17 -0.47 -0.99
1 -1.27 -0.33  0.94  0.02 -0.89  1.58 -0.27  0.81 -0.15  1.07
2  0.24  1.43 -1.95 -1.84  1.48 -1.47  0.89  0.71  0.08  0.25
3  0.81  1.29  0.43  1.00 -0.76  0.65 -1.26  0.11 -0.47  0.42
4 -0.23 -1.08 -1.02 -0.32  1.35 -0.82 -0.06 -1.41 -1.19 -0.99
5 -0.56  0.28  0.86  0.85 -0.55 -0.21  0.24 -1.54 -0.79  0.90
6 -1.30  0.21 -0.08  0.07 -0.38 -0.70  0.75 -0.05  1.44 -1.47
7  1.10 -1.28  0.30 -0.82  0.63  0.12  1.25  1.19  1.56  0.82

65) Compute the correlation of each row of df with its succeeding row.

In [187]:
df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1))

[df.iloc[i].corr(df.iloc[i+1]).round(2) for i in range(df.shape[0])[:-1]]

[-0.29, -0.03, 0.11, 0.38, -0.51, -0.15, -0.47]

66) Replace both values in both diagonals of df with 0.

In [188]:
df = pd.DataFrame(np.random.randint(1,100, 100).reshape(10, -1))
df
#     0   1   2   3   4   5   6   7   8   9
# 0  11  46  26  44  11  62  18  70  68  26
# 1  87  71  52  50  81  43  83  39   3  59
# 2  47  76  93  77  73   2   2  16  14  26
# 3  64  18  74  22  16  37  60   8  66  39
# 4  10  18  39  98  25   8  32   6   3  29
# 5  29  91  27  86  23  84  28  31  97  10
# 6  37  71  70  65   4  72  82  89  12  97
# 7  65  22  97  75  17  10  43  78  12  77
# 8  47  57  96  55  17  83  61  85  26  86
# 9  76  80  28  45  77  12  67  80   7  63
for i in range(df.shape[0]):
    df.iat[i, i] = 0
    df.iat[df.shape[0]-i-1, i] = 0

67) Using a key in a grouped data frame. From df_grouped, get the group belonging to 'apple' as a dataframe.

In [190]:
df = pd.DataFrame({'col1': ['apple', 'banana', 'orange'] * 3,
                   'col2': np.random.rand(9),
                   'col3': np.random.randint(0, 15, 9)})

df_grouped = df.groupby(['col1'])

df_grouped.get_group('apple')

    col1      col2  col3
0  apple  0.676835    12
3  apple  0.383451     5
6  apple  0.702984     3

68) In df, find the second largest value of 'taste' for 'banana'

In [192]:
df = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                   'rating': np.random.rand(9),
                   'price': np.random.randint(0, 15, 9)})

df_grpd = df['rating'].groupby(df.fruit)
df_grpd.get_group('banana').sort_values().iloc[-2]

0.5498192724260969

69) In df, Compute the mean price of every fruit, while keeping the fruit as another column instead of an index.

In [193]:
df = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                   'rating': np.random.rand(9),
                   'price': np.random.randint(0, 15, 9)})

df.groupby('fruit', as_index=False).mean()

    fruit    rating     price
0   apple  0.538743  8.666667
1  banana  0.487752  5.333333
2  orange  0.403005  8.000000

70) Join dataframes df1 and df2 by ‘fruit-pazham’ and ‘weight-kilo’.

In [194]:
df1 = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                    'weight': ['high', 'medium', 'low'] * 3,
                    'price': np.random.randint(0, 15, 9)})

df2 = pd.DataFrame({'pazham': ['apple', 'orange', 'pine'] * 2,
                    'kilo': ['high', 'low'] * 3,
                    'price': np.random.randint(0, 15, 6)})

pd.merge(df1, df2, left_on = ['fruit','weight'],
                    right_on = ['pazham','kilo'],
                    how = 'inner')

    fruit weight  price_x  pazham  kilo  price_y
0   apple   high        3   apple  high        5
1   apple   high       12   apple  high        5
2   apple   high        8   apple  high        5
3  orange    low        0  orange   low        3
4  orange    low        4  orange   low        3
5  orange    low        5  orange   low        3

71) Get the positions where the value of two columns match.

In [195]:
df = pd.DataFrame({'fruit1': np.random.choice(['apple', 'orange', 'banana'], 10),
                    'fruit2': np.random.choice(['apple', 'orange', 'banana'], 10)})
np.where(df.fruit1 == df.fruit2)

(array([3], dtype=int64),)

72) Create two new columns in df, one of which is a lag1 (shift column a down by 1 row) of column ‘a’ and the other is a lead1 (shift column b up by 1 row).

In [196]:
df = pd.DataFrame(np.random.randint(1, 100, 20).reshape(-1, 4), columns = list('abcd'))

#     a   b   c   d
# 0  66  34  76  47
# 1  20  86  10  81
# 2  75  73  51  28
# 3   1   1   9  83
# 4  30  47  67   4

df['a_lag1'] = df['a'].shift(1)
df['b_lead1'] = df['b'].shift(-1)

73) Get the frequency of unique values in the entire dataframe df.

In [197]:
df = pd.DataFrame(np.random.randint(1, 10, 20).reshape(-1, 4), columns = list('abcd'))

pd.value_counts(df.values.ravel())

9    5
3    5
5    3
4    3
6    3
1    1
dtype: int64

74) Split the string column in df to form a dataframe with 3 columns as shown.

In [198]:
df = pd.DataFrame(["STD, City    State",
"33, Kolkata    West Bengal",
"44, Chennai    Tamil Nadu",
"40, Hyderabad    Telengana",
"80, Bangalore    Karnataka"], columns=['row'])

print(df)
df_out = df.row.str.split(',|\t', expand=True)
new_header = df_out.iloc[0]
df_out = df_out[1:]
df_out.columns = new_header
print(df_out)

                          row
0          STD, City    State
1  33, Kolkata    West Bengal
2   44, Chennai    Tamil Nadu
3  40, Hyderabad    Telengana
4  80, Bangalore    Karnataka
0 STD            City    State
1  33   Kolkata    West Bengal
2  44    Chennai    Tamil Nadu
3  40   Hyderabad    Telengana
4  80   Bangalore    Karnataka